package kr.or.ddit.study04;

import java.util.Scanner;

public class HomeWork4 {
	Scanner sc = new Scanner(System.in);

	public static void main(String[] args) {
		HomeWork4 obj = new HomeWork4();
		obj.method1();
//		obj.method2();
//		obj.method3();
		obj.method4();
		
	}

	private void method4() {
		// TODO Auto-generated method stub
		
	}

	private void method3() {
		/*
		 * for 문 2개를 이용하여 구구단 전체를 출력하시오
		 * 스캐너를 통해 숫자를 입력 받고 해당 숫자에 해당하는 구구단은 제외. 
		 * ex ) 입력 3 
   			2*1 =2	..............	
			2*2 =4	4*2 =8	5*2 =10	6*2 =12	7*2 =14	8*2 =16	9*2 =18	
			2*3 =6	4*3 =12	5*3 =15	6*3 =18	7*3 =21	8*3 =24	9*3 =27	
			2*4 =8	4*4 =16	5*4 =20	6*4 =24	7*4 =28	8*4 =32	9*4 =36	
			2*5 =10	4*5 =20	5*5 =25	6*5 =30	7*5 =35	8*5 =40	9*5 =45	
			2*6 =12	4*6 =24	5*6 =30	6*6 =36	7*6 =42	8*6 =48	9*6 =54	
			2*7 =14	4*7 =28	5*7 =35	6*7 =42	7*7 =49	8*7 =56	9*7 =63	
			2*8 =16	4*8 =32	5*8 =40	6*8 =48	7*8 =56	8*8 =64	9*8 =72	
			2*9 =18	4*9 =36	5*9 =45	6*9 =54	7*9 =63	8*9 =72	9*9 =81	

		 */
		//for문으로 a*b의 b먼저 쭉 나열하고(먼저 고정기준이 되는 변수부터 for문 만들기!!)
		// 입력받은값과 다른 a를 1씩 증가시켜서 나열함
		System.out.println("숫자를 입력하시오.");
		int dan = sc.nextInt();    //a*b 형태
		for( int b =1; b<=9;b++) { //가로줄 쭉 동일한 b의 값이 반복해서 나오는 상황에서
			for( int a=2; a<=9; a++) {// dan과 같지 않은 a값은 1씩 커지면서 나옴(가로줄완성)->println로 행을 바꿔야함
				if(dan != a) {		  
					System.out.printf("%d * %d = %d\t",a,b,a*b);
		//방법2 CONTINUE사용
					
				}
			}
			System.out.println(); // 
		}
	}

	private void method2() { //면접 기출임 
		/*
		 * for 문 2개를 이용하여 구구단 전체를 출력하시오.
		 *  2*1 =2	3*1 =3	..............	
			2*2 =4	3*2 =6	4*2 =8	5*2 =10	6*2 =12	7*2 =14	8*2 =16	9*2 =18	
			2*3 =6	3*3 =9	4*3 =12	5*3 =15	6*3 =18	7*3 =21	8*3 =24	9*3 =27	
			2*4 =8	3*4 =12	4*4 =16	5*4 =20	6*4 =24	7*4 =28	8*4 =32	9*4 =36	
			2*5 =10	3*5 =15	4*5 =20	5*5 =25	6*5 =30	7*5 =35	8*5 =40	9*5 =45	
			2*6 =12	3*6 =18	4*6 =24	5*6 =30	6*6 =36	7*6 =42	8*6 =48	9*6 =54	
			2*7 =14	3*7 =21	4*7 =28	5*7 =35	6*7 =42	7*7 =49	8*7 =56	9*7 =63	
			2*8 =16	3*8 =24	4*8 =32	5*8 =40	6*8 =48	7*8 =56	8*8 =64	9*8 =72	
			2*9 =18	3*9 =27	4*9 =36	5*9 =45	6*9 =54	7*9 =63	8*9 =72	9*9 =81	
		 */
		for(int b =1; b<=9;b++) {    //for(int a =2;a<=9;a++)<-방법2
			
			for(int a =2;a<=9;a++) { //for(int a ;a<=9;a++) <-방법2
				System.out.printf("%d * %d = %d\t",a,b,b*a);//가로로 값이 쭉 나오고~
			}System.out.println();							//2*1=2 3*1=3 4*1=4---> 
															//println을 해서 행을 바꿔줌
		}
		 
		
	}

	private void method1() {
		/*
		 * 스캐너를 통해 숫자를 입력받고 해당 숫자에 해당하는 구구단을 출력하시오
		 *  3*1 =3	
			3*2 =6	
			3*3 =9	
			3*4 =12
			3*5 =15
			3*6 =18
			3*7 =21
			3*8 =24
			3*9 =27
		 */
		System.out.println("1~9사이의 숫자를 입력하시오.");
		int dan = sc.nextInt();
		for( int i=1; i<=9; i++) {
			System.out.printf("%d * %d =%d\n",dan,i,dan*i);
		}
		
		//방법2 (사직찍었음)
		
		
		
	}

}
